## SImple

### Contoh 1

In [ ]:
import sqlite3
conn=sqlite3.connect('mydatabase.db')
cursor=conn.cursor()

Penjelasan:

Dalam contoh ini, kita menggunakan modul sqlite3 untuk terhubung ke basis data SQLite.

Koneksi dibuka ke database, dan sebuah kursor dibuat untuk menjalankan perintah SQL.

Setelah operasi selesai, koneksi ditutup.

In [ ]:
import sqlite3
conn=sqlite3.connect('mydatabase.db')
cursor=conn.cursor()

#membuat tabel mahasiswa
cursor.execute('''CREATE TABLE mahasiswa (nama TEXT, usia INT)''')

#memasukan beberapa data
data_mahasiswa=[
    ('Rizki',21),
    ('Rahmad',20),
    ('Mahrom',23)
]
cursor.executemany("INSERT INTO mahasiswa VALUES (?, ?)", data_mahasiswa)
conn.commit()

Penjelasan:

Dalam contoh ini, kita membuat tabel dalam basis data SQLite ('mahasiswa') dan memasukkan beberapa data ke dalamnya.
Data mahasiswa disisipkan menggunakan executemany, yang memungkinkan kita untuk menyisipkan beberapa baris data sekaligus.
Setelah operasi selesai, perubahan dicommit dan koneksi ditutup.

## Intermediate

### Contoh 1

In [ ]:
nama=input('Masukan nama: ')
cursor.execute(f'SELECT * FROM mahasiswa WHERE nama = "{nama}"')
data=cursor.fetchall()
if data:
  for row in data:
    print('Nama: ', row[0])
    print('Usia: ', row[1])
else:
  print('Data Tidak Ditemukan')

Masukan nama: Rizki
Nama:  Rizki
Usia:  21

Penjelasan:

Dalam contoh ini, kita mengambil data dari basis data SQLite berdasarkan nama yang dimasukkan oleh pengguna.

Perintah SQL dijalankan untuk mencari data, dan data kemudian ditampilkan dalam format terstruktur.

Dalam contoh ini, kita menggunakan parameter dalam perintah SQL untuk menghindari risiko SQL injection.
Penggunaan parameter memungkinkan kita untuk mengamankan perintah SQL saat menggunakan input pengguna.

## Advanced

### Contoh 1

In [ ]:
import sqlite3
conn=sqlite3.connect('mydatabase.db')
cursor=conn.cursor()
#menjalankan kueri gabungan
cursor.execute(""" SELECT mahasiswa.nama,mata_kuliah.kode
FROM mahasiswa
JOIN mata_kuliah
ON mahasiswa.id = mata_kuliah.makasiswa_id""")
data =cursor.fetchall()
for row in data:
  print('Nama Mahasiswa ', row[0])
  print('Kode Mata Kuliah ', row[1])

OperationalError: no such table: mata_kuliah

In [ ]:
import sqlite3
import csv

# conn = sqlite3.connect('mydatabase.db')
# cursor = conn.cursor()

# Menjalankan kueri
cursor.execute("SELECT * FROM mahasiswa")

data = cursor.fetchall()

with open('output.csv', 'w', newline='') as csv_file:
    csv_writer = csv.writer(csv_file)

    # Menulis header
    csv_writer.writerow([i[0] for i in cursor.description])

    # Menulis data
    csv_writer.writerows(data)

conn.close()